Revit 2027 API
Space.Room Property
Return the Room of the space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Room Room { get; }
Public ReadOnly Property Room As Room
	Get
public:
property Room^ Room {
	Room^ get ();
}
member Room : Room with get
Property Value
Room
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace